In [1]:
import pandas as pd
import numpy as np

In [2]:
Roll=[1,2,3,4,5,6]
Names=["Tanmay","Diksha","Nikita","Krishna","Ananya","Khayati"]

In [3]:
df=pd.DataFrame(Roll)

df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [47]:
df['Names']=pd.Series(Names)

In [48]:
df

   Roll Number    Names
0            1   Tanmay
1            2   Diksha
2            3   Nikita
3            4  Krishna
4            5   Ananya
5            6  Khayati

In [49]:
data= {'Name':['Freya', 'Mohak'],'Age':[9,10],'Gender':['F','M']}
df1 = pd.DataFrame(data)
df1['Marks']=pd.Series([89,79])
print (df1)

    Name  Age Gender  Marks
0  Freya    9      F     89
1  Mohak   10      M     79

In [50]:
#If we have multiple dictionaries with us then each dictionary is represented as a different row

data1 = [{'x': 1, 'y': 2},{'x': 5, 'y': 4, 'z': 5}]
df2=pd.DataFrame(data1)
df2

   x  y    z
0  1  2  NaN
1  5  4  5.0

In [51]:
#if we have only one dictionary then all the keys are differnt columns 

d1 ={'one'  pd.Series([1, 2, 3], index=['a', 'b', 'c']),'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
df3=pd.DataFrame(d1)
df3

SyntaxError: invalid syntax (<ipython-input-51-a6f6e1cf5f65>, line 3)

In [52]:
df4=pd.read_table('Data1.txt', delim_whitespace=True,names=('A', 'B', 'C'))
df4

   A  B      C
0  1  1  12.92
1  1  2  90.75
2  1  3  60.90
3  2  1  71.34

In [53]:
df4['Total']=df4['A']+df4['B']+df4['C']
df4

   A  B      C  Total
0  1  1  12.92  14.92
1  1  2  90.75  93.75
2  1  3  60.90  64.90
3  2  1  71.34  74.34

In [54]:
import pandas as pd

In [55]:
Roll=[1,2,3,4,5,6]
Names=["Tanmay","Diksha","Nikita","Krishna","Ananya","Khayati"]
df=pd.DataFrame(Roll)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [56]:
df.columns=['Roll']
df['Names']=pd.Series(Names)
#df.sort_values('Roll',ascending=False)
df

   Roll    Names
0     1   Tanmay
1     2   Diksha
2     3   Nikita
3     4  Krishna
4     5   Ananya
5     6  Khayati

In [57]:
df

   Roll    Names
0     1   Tanmay
1     2   Diksha
2     3   Nikita
3     4  Krishna
4     5   Ananya
5     6  Khayati

In [58]:
df['Marks from']=100
df

   Roll    Names  Marks from
0     1   Tanmay         100
1     2   Diksha         100
2     3   Nikita         100
3     4  Krishna         100
4     5   Ananya         100
5     6  Khayati         100

In [59]:
df['Marks1']=pd.Series([78,85,96,87,69,85])

In [60]:
df

   Roll    Names  Marks from  Marks1
0     1   Tanmay         100      78
1     2   Diksha         100      85
2     3   Nikita         100      96
3     4  Krishna         100      87
4     5   Ananya         100      69
5     6  Khayati         100      85

In [61]:
df['Marks2']=pd.Series([96,95,86,95,89,90])

In [62]:
df

   Roll    Names  Marks from  Marks1  Marks2
0     1   Tanmay         100      78      96
1     2   Diksha         100      85      95
2     3   Nikita         100      96      86
3     4  Krishna         100      87      95
4     5   Ananya         100      69      89
5     6  Khayati         100      85      90

In [63]:
df['Aggregate']=(df['Marks1']+df['Marks2'])/2
df

   Roll    Names  Marks from  Marks1  Marks2  Aggregate
0     1   Tanmay         100      78      96       87.0
1     2   Diksha         100      85      95       90.0
2     3   Nikita         100      96      86       91.0
3     4  Krishna         100      87      95       91.0
4     5   Ananya         100      69      89       79.0
5     6  Khayati         100      85      90       87.5

In [64]:
df.to_csv(r'C:\Users\pulki\Desktop\Result.csv',index=False,header=True)

In [23]:
d={'roll':[1,2,3,4,5,6],'names':["Tanmay","Diksha","Nikita","Krishna","Ananya","Khayati"],'Marks from':100,'Marks1':[78,85,96,87,69,85],'Marks2':[96,95,86,95,89,90]}
df1=pd.DataFrame(d)
df1

   roll    names  Marks from  Marks1  Marks2
0     1   Tanmay         100      78      96
1     2   Diksha         100      85      95
2     3   Nikita         100      96      86
3     4  Krishna         100      87      95
4     5   Ananya         100      69      89
5     6  Khayati         100      85      90

In [25]:
df1['Aggregate']=(df1['Marks1']+df1['Marks2'])/2
df1

   roll    names  Marks from  Marks1  Marks2  Aggregate
0     1   Tanmay         100      78      96       87.0
1     2   Diksha         100      85      95       90.0
2     3   Nikita         100      96      86       91.0
3     4  Krishna         100      87      95       91.0
4     5   Ananya         100      69      89       79.0
5     6  Khayati         100      85      90       87.5

In [10]:
import pandas as pd
df.sort_values(by='Marks1',ascending=False)
df

NameError: name 'df' is not defined

In [3]:
import pandas as pd
df2=pd.read_table('dataforframe.txt', delim_whitespace=True,names=('Sno', 'Country', 'Year', 'Value' ))
df2

   Sno Country  Year  Value
0    1   India  2005      6
1    2   India  2005     13
2    3   India  2005     10
3    4   India  2005     11
4    5   India  2005      5
5    1   India  2006      3
6    2   India  2006      2
7    3   India  2006      7
8    4   India  2006      3
9    5   India  2006      6

In [32]:
import pandas as pd
df10=pd.read_csv("MyCSV.csv")
df10

         Date   price  Product    Company
0  23/04/2020  2000.0  Shampoo   Bodyshop
1  24/04/2020  1200.0   Sweets   Haldiram
2  25/04/2020     NaN     Food  BigBazaar

In [33]:
df10.shape

(3, 4)

In [8]:
df10.head(1)

         Date  price  Product   Company
0  23/04/2020   2000  Shampoo  Bodyshop

In [9]:
df10.tail(1)

         Date  price Product   Company
1  24/04/2020   1200  Sweets  Haldiram

In [11]:
df10.pop('Company')

0    Bodyshop
1    Haldiram
Name: Company, dtype: object

In [12]:
df10

         Date  price  Product
0  23/04/2020   2000  Shampoo
1  24/04/2020   1200   Sweets

In [29]:
import pandas as pd
import numpy as np
raw_data1 = {'name': ['freya', 'mohak','ram'],'age': [10, 1, 12],'favorite_color': ['pink', 'blue','green'],'grade': [88, 92, 95]}
df = pd.DataFrame(raw_data1, columns = ['name', 'age','favorite_color', 'grade'])
df[['name','age']]

    name  age
0  freya   10
1  mohak    1
2    ram   12

In [30]:
for index, row in df.iterrows():
    print (row["name"], row["age"])

freya 10
mohak 1
ram 12

In [34]:
df10.loc[:'price']

         Date   price  Product    Company
0  23/04/2020  2000.0  Shampoo   Bodyshop
1  24/04/2020  1200.0   Sweets   Haldiram
2  25/04/2020     NaN     Food  BigBazaar

In [37]:
left = pd.DataFrame({'id':[1,2],'Name': ['anil', 'vishal'],'subject_id':['sub1','sub2']})
right = pd.DataFrame({'id':[1,2],'Name': ['sumer', 'salil'],'subject_id':['sub2','sub4']})
left

   id    Name subject_id
0   1    anil       sub1
1   2  vishal       sub2

In [38]:
right

   id   Name subject_id
0   1  sumer       sub2
1   2  salil       sub4

In [39]:
print (pd.merge(left,right,on='id'))

   id  Name_x subject_id_x Name_y subject_id_y
0   1    anil         sub1  sumer         sub2
1   2  vishal         sub2  salil         sub4

In [40]:
print(pd.merge(left, right, on='subject_id', how='left')) #left join

   id_x  Name_x subject_id  id_y Name_y
0     1    anil       sub1   NaN    NaN
1     2  vishal       sub2   1.0  sumer

In [41]:
print(pd.merge(left, right, on='subject_id', how='right')) #right join

   id_x  Name_x subject_id  id_y Name_y
0   2.0  vishal       sub2     1  sumer
1   NaN     NaN       sub4     2  salil

In [42]:
print(pd.merge(left, right, how='outer', on='subject_id')) #outer join (UNION)

   id_x  Name_x subject_id  id_y Name_y
0   1.0    anil       sub1   NaN    NaN
1   2.0  vishal       sub2   1.0  sumer
2   NaN     NaN       sub4   2.0  salil

In [43]:
print(pd.merge(left, right, on='subject_id', how='inner')) # innerjoin (INTERSECTION)

   id_x  Name_x subject_id  id_y Name_y
0     2  vishal       sub2     1  sumer